## Import necessary libraries

In [1]:
import pandas as pd
import numpy as np
from sklearn.preprocessing import LabelEncoder
from sklearn.model_selection import train_test_split
from sklearn import tree

## Loading the dataset

In [2]:
df = pd.read_csv("train.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

## Dropping unwanted columns

In [3]:
df.drop(['PassengerId', 'Pclass', 'SibSp','Parch', 'Ticket', 'Cabin', 'Embarked'], axis=1, inplace=True)

In [4]:
df.head()

,Survived,Name,Sex,Age,Fare
0,0,"Braund, Mr. Owen Harris",male,22.0,7.2500
1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,71.2833
2,1,"Heikkinen, Miss. Laina",female,26.0,7.9250
3,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,53.1000
4,0,"Allen, Mr. William Henry",male,35.0,8.0500

## Calculating the mean of Age column to fill the missing value

In [5]:
me = df['Age'].mean()
me

29.69911764705882

In [6]:
mean = 30

In [7]:
df['Age'].fillna(value= mean, inplace=True)

In [8]:
count = df['Age'].value_counts()
count.head()

30.0    202
24.0     30
22.0     27
18.0     26
28.0     25
Name: Age, dtype: int64

## Deviding the Features and the Target value

In [9]:
features = df.drop('Survived' , axis = 'columns')
target = df['Survived']

In [10]:
features.head()

                                                Name     Sex   Age     Fare
0                            Braund, Mr. Owen Harris    male  22.0   7.2500
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0  71.2833
2                             Heikkinen, Miss. Laina  female  26.0   7.9250
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0  53.1000
4                           Allen, Mr. William Henry    male  35.0   8.0500

In [11]:
target.head()

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

## Changing the non-numeric values of the features in to numbers

In [12]:
from sklearn.preprocessing import LabelEncoder

In [13]:
N_le= LabelEncoder()
S_le= LabelEncoder()

In [14]:
features['na_le'] = N_le.fit_transform(features['Name'])
features['se_le'] = S_le.fit_transform(features['Sex'])

In [15]:
features.head()

,Name,Sex,Age,Fare,na_le,se_le
0,"Braund, Mr. Owen Harris",male,22.0,7.2500,108,1
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,71.2833,190,0
2,"Heikkinen, Miss. Laina",female,26.0,7.9250,353,0
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,53.1000,272,0
4,"Allen, Mr. William Henry",male,35.0,8.0500,15,1

In [16]:
features_N = features.drop(['Name', 'Sex'], axis = 1) 
features_N.head()

    Age     Fare  na_le  se_le
0  22.0   7.2500    108      1
1  38.0  71.2833    190      0
2  26.0   7.9250    353      0
3  35.0  53.1000    272      0
4  35.0   8.0500     15      1

In [17]:
x = features_N
y = target

## Spliting the dataset in to train and test data

In [18]:
x_train,x_test,y_train,y_test=train_test_split(x,y,test_size=0.2, train_size=0.8)

## Creating an object of the classification model

In [19]:
model = tree.DecisionTreeClassifier()

In [20]:
model.fit(x_train, y_train)

DecisionTreeClassifier(class_weight=None, criterion='gini', max_depth=None,
            max_features=None, max_leaf_nodes=None,
            min_impurity_decrease=0.0, min_impurity_split=None,
            min_samples_leaf=1, min_samples_split=2,
            min_weight_fraction_leaf=0.0, presort=False, random_state=None,
            splitter='best')

## Checking accuracy of the model

In [21]:
model.score(features_N, target)

0.9595959595959596

## Prediction

In [22]:
model.predict([[26.0, 7.9250, 353, 0]])

array([1], dtype=int64)

## so we get a high accuracy with decition tree classifier